** Saving File Names in registers.
   #+BEGIN_SRC emacs-lisp
     (set-register ?a `(file . "/var/log/syslog"))
   #+END_SRC

   #+RESULTS:
   : (file . /var/log/syslog)
   To save the file name in register a run the above code.
   This can be useful if you want to visit some particular files regularly.
